const CHAOSWIKI = () => {
  return (
    <div className="page-wrap">
      <h1>Game WIKI</h1>
      <p>骑士领主与冒险团rpg游戏。</p>
      <p>
        现世蓝星：有一天，太阳上生长血肉树枝，月亮开始发笑，星光中传来扭曲的知识，世界各地诞生恐怖的断界，人类一度接近灭亡。
        十三位王在灵界天使的引导下，穿越断界与界痕之间交错的危域，抵达那片被遗忘的旧日神山。他们用天幕遮蔽真实星辰，用虚假之日编织新秩序，
        只为阻止外界回响的污染继续蚕食最后的人类文明。可是天幕与神山是残缺的，所以十三位王在灵界天使的指引下献祭自身，成为天柱。
        在天幕与神山的庇护下，人们掌握了大地上的断界，有了固定的产出，文明逐渐恢复过来。在文明重建后，人们发现这个新世界变得比以前大了很多很多，
        光是天幕之下，从南到北就有九万里。天空与深海成为了禁区，越是深入，就越是远离天幕的庇护。大地深处也不能挖掘太深，容易碰到深渊延伸至此的本体。
        面对地底，诞生了地下城。面对天空与深海，诞生了气象局。尽管有天幕的庇护，还是会有新生的断界，每当闰年，笑月会击穿天幕的壁垒，引发大量断界的诞生。
        而每当日蚀，太阳上的世界树会降下祂的枝桠，坠落更加恐怖的断界。
      </p>
      <p>
        断界:深渊力量渗透的世界碎片,但是,如果清除了深渊力量,那么世界碎片还是很有用的。世界碎片就像是一个个位面一个个游戏副本。
        通过清理局特有仪器,能够判定扭曲度。扭曲度超过临界点的断界会崩坏,外界时空一同进一步感染恶化,内部的深渊怪物会汲取现世源力进一步成长。
        为了避免这个后果,清理局定期出动解决深渊怪物。扭曲度为0的稳定断界,会慢慢融入世界秩序，成为稳定产出超凡资源的秘境。
        因为汲取断界中的技术，人类文明变成一个魔幻与科技并存的世界，既有电机计算机，又有超能力骑士，有飞艇与战舰，还有魔法傀儡和宠物。
      </p>
      <p>
        十三王国：十三王国只是一个泛指，只是说明是十三个君主制国家，但实际上，十三个王国，各有自称和体制。
        十三王国创始的王都是半神，尽管成为了半死不活天柱，但他们的后代也有神力，所以尽管技术发展，王室统治基本上牢不可破。
        而且也不光是王室，各国内大大小小的贵族世家，因为领先一步垄断控制了秘境化了的断界，控制了超凡的稳定晋升通道，尤其是更高级的力量来源。
        晋升路径包括但不限于： 公司型财团（如高层仅开放“深界晋升”资格）
        军队体系（通过军功授予超凡进化配额）
        内务/政务系统（特定部门控制通行证与通道）
        学术/修行体制（通过秘法考试、遗迹研究、神明契约筛选晋阶者）
        那些想要自由的，要么跑到大海上，要么去地下城，在天幕庇护微弱的恶劣环境中寻找断界中的机缘。
        在正常时期，断界比较少，而且比较弱，所以贵族们也懒得争夺。而深海、深入天空、深入地下，在天幕之外，除了半神没有谁敢说一定不死。但是在笑月阶段、日蚀阶段，地面上也会出现很多机缘，这会导致国与国之间的战争，无数人参与其中。
        在十三王国有意识的控制下，所有人出生起都认为他们的世界，就是这个九万里之大的地方，涵盖地理:十三王国所在的大陆,伊尔德兰神山就是世界最北，南方的迷雾海就是世界最南。
      </p>
      <div>
        气象局：和学术机构有深度关联的组织，成员都是大学毕业的高材生。里面的王室及贵族也是这类学术背景的。
        以知识抱团的，自认清高，看不起清理局的作风，但是也排斥学术圈之外的人，并且存在着学术家族。在这里，王室与贵族会采取与普通人联姻的方式延续权力。
        大学联盟：十三王国共同出资运营的高等学术体系，培养各类精英，尤其是气象局、行政系统、断界科研人员的来源。
        结构上是一个“联邦制”的教育体系，保留各国大学自治权，但有统一的“天幕标准考试”和“知识等级评定”。
        顶尖大学如“旧日科学院”、“星核技术大学”、“圣山学术机构”等。王公贵族家族通常掌控若干学院，形成“学术贵族家族”，
        他们将权力包裹在知识与标准中，塑造“无权者没有资格讲话”的学术壁垒。
        设定张力点： 平民学生与贵族教授的矛盾； 学术造假、知识垄断事件；
        某个教授私自泄露禁忌研究，引发断界化事故。
      </div>
      <div>
        清理局：除非是实在没有出路的人，很少有人会选择去清理局，因为那就是给王公贵族们当炮灰。他们负责督战，领功劳，拿资源，成长为超凡英雄。
      </div>
      <div>
        气象局 vs 清理局：体制冲突经典组合
        气象局是典型“技术官僚体制”，注重数据、理论、统计，内部等级森严。
        清理局则是“实战派”，前线出身者居多，鄙视“坐办公室的书呆子”。
        两者冲突不断，却又必须协作：气象局给清理局断界爆发预警，清理局用血还回一份份数据。
        ⚡设定张力点： 一次联合任务失败，彼此互相推锅；
        清理局某位老兵突破断界禁限，成为王国都忌惮的“英雄变异体”；
        气象局发现了一个“数据不该出现的地方”，却选择隐瞒。
      </div>
      <div>
        地下城：一个特殊的独立于十三王国之外，接受十三王国经费的，类似工匠组织。
        由无数个公会组成的公会联盟，有冒险公会，也有石匠公会、木匠公会、巫师公会、魔女公会等等。
      </div>
      <div>
        远征军：天幕虽然强大，但也需要维护，减轻负担，必须定期派人到天幕世界之外的魔界中战斗。
        十三王国本来是各自为战，各自负责自己那一部分的天幕边缘，但是因为魔界之门的降临，与其中一国的覆灭，
        为了夺回天柱，关闭魔界之门，联合组织了远征军，只不过因为远征军司令部的权力斗争复杂，所以远征军暂时还没行动。
      </div>
      <div>
        拜月教：与十三王国为敌，主张月亮的“神笑”是开启人类命运转折的钥匙，领袖为拜月教主，认为当前的天空与日月星辰是虚假的，
        要把外界的真理带进来。研究天幕世界之外的力量。在关键时刻帮助一个王国取得胜利，借助王室的权限掀开天幕的一角-通往魔界的门扉。
      </div>
      <div>
        海盗团：笑月海盗团，裂潮海盗团，白鲸海盗团，北极独角海盗团
        深海种族：深海拒绝深渊的污染，但是深海也会感染人。比如寄生在人身上的海兽病。
      </div>
      <div>
        赫尔姆莱因Helmrein - 黑舰之国 种族：人类 信仰：战争之神
        风格：军国主义、重工业、铁血帝制、深海武备 与魔界同时在地面与海上交界。
        象征舰:黑舰Ironwake——装甲覆海、火炮震天、以火药与深海技术铸成的海上堡垒
        特色：强制征兵制，精英军团皆拥有初阶神性强化，秘密研究“鲸骨战术”与“潮能反应炉”
      </div>
      <div>
        索雅尔联邦Soyar - 宝塔舰之国 种族：树精灵，龙族 信仰：灵界之主，灵界天使
        风格：学术贵族治国、半共和形式的学会联合体、海上奥术炼金、图书舰队
        与魔界同时在地面与海上交界。 象征舰:宝塔舰 Verdant
        Spire——悬浮的研究之塔,帆如经卷,主桅为灵界天线
        特色：以“舰会”治理国家，贵族皆出自学术家族，拥有独立的“舰上大学”与“飞塔议会
      </div>
      <div>
        伊尔德兰Ilderan
        别名：雪国神山、永寒王朝地理：位于最北边界，冰雪覆盖的高山国度，境内拥有一座“原初神山”——传说中天幕破裂的第一个锚点，世界的第一道“神痕”。
        与魔界没有任何地面、海上接触的地方。
        国力：人口稀少、资源紧张、军队规模小，但因掌握“神山祭仪”与“寒界法印”，拥有特殊的外交地位。
        文化：极端的尊神传统与家族血统崇拜。所有贵族都必须完成“登顶仪式”以激活血脉的寒霜潜能。
        特色： 被动魔法适性高（冰霜血脉觉醒）
        特产“神山之泪”——强化神性与寒系术法的晶体
        出产少量顶级“仪式术士”与“寒律骑士”
        在国际事务中拥有“神痕守望国”的身份，享有象征性的监督权
      </div>
      <div>
        阿斯托维恩Astovienne 别名：魔法贵族国、血术之都。 种族：血精灵
        地理：温带高原，由火山断界衍生出的“魔能泉源”灌注整片土地，是魔法强者的温床。在山脉中与魔界交界。
        国力：小而强，极度重视血统与个人天赋，具有令人畏惧的魔法战力输出。王室为“原始魔源”的继承者，拥有不需媒介的术式本能
        文化：极端的“魔力至上论”——认为强者不该受规则约束，王族直接统领法师团，政法合一
        特色：所有民众自幼测试魔法资质，非天赋者直接沦为下层,国家机制支持高密度术式实验,王宫就是最大“魔法试炼塔”
        拥有“真名术”传承，知其名可主其命,极度排他，禁止他国“血统低劣者”掌握高阶魔法
        在序幕的世界大战中，与艾兰德尔帝国走向战争，在魔法抗性几乎无敌的骑士军团面前节节败退，
        不得不掀开天幕一角，打开魔界之门。最后尽管消灭了来犯之敌，但也迎来了王国灭亡的命运，而且成为了魔界入侵的桥头堡。
      </div>
      <div>
        泰尔索纳Tersona 别名：金币王国、机械帝国 种族：人类，地精
        地理：位于十字商道的交汇点，周围有重要的矿藏与交通枢纽，拥有广阔的平原与海岸线，便利的地理位置使其成为其他王国的经济中心。
        在海洋上与魔界交界。
        国力：虽然个人战斗力较弱，但通过先进的工程技术、海军、空军、装甲火力武器和机械兵团，具备强大的间接战力。
        文化：金钱至上的国家理念，认为“财富与技术是支配一切的力量”。社会秩序严格遵循金钱法则，权力与财富紧密挂钩，社会结构极其富有竞争性。
        王族由拥有最多金债的家族轮流接任，财富即是权力的象征。
        政治：王室与财团家族的密切结合。整个国家的管理体系由八大金团统领，每个金团负责不同的领域，如贸易、武器、能源、银行等。
        国家实质上是一个由财团领导的“资本家王国”，每个家族都拥有自己的独立区域，并通过金债体系互相联系与制衡。
      </div>
      <div>
        卡尔德瑞亚 Calderia别名:宠兽帝国、兽之国 种族：兽人
        地理：卡尔德瑞亚位于一片广袤的森林高原与草原交界处，地形复杂，既有适合飞行生物栖息的高山，又有广阔的草原供猛犸等大型兽类活动。
        国土内有精深的原野森林和荒野山脉，自然环境为其宠物战斗体系提供了独特的栖息和训练空间。在草原上与魔界交界。
        国力：凭借宠物战斗部队的强大力量，尤其是拥有世界闻名的龙骑士和庞大的猛犸部队，卡尔德瑞亚在战斗力上拥有独特的优势。
        文化：卡尔德瑞亚人崇尚自然与野生力量，视宠物为战斗中的伙伴而非工具。他们的文化深受兽灵影响，认为人与自然的联系是强大力量的源泉。
        人类与动物的关系在这个国家中被视为至高无上的伙伴关系，每一只宠物都可能成为英雄、军队中的成员或战场上的关键力量。
      </div>
      <div>
        艾兰德尔帝国 The Empire of Erandel
        别名：骑士帝国、钢铁王国地理：艾兰德尔帝国位于广袤的平原与山脉之间，拥有丰富的矿产和森林资源。
        首都坐落在一座巨大的古堡中，周围被钢铁城墙和无数的骑士要塞保护。帝国的境内有许多坚固的城堡与军营，军事化管理极为严密。
        艾兰德尔的边疆常年与蛮族、魔物等进行冲突，骑士们常年在战斗中磨砺自己的战力。与魔界同时在地面与海上交界。
        国力：虽然艾兰德尔在魔法领域不如其他国家，但它拥有的骑士军团和强大的武力使得它成为一个无可小觑的军事强国。
        骑士领主制使得这个国家的力量分散，但每个领主都是极强的战士和魔法使者，能为国家贡献极强的战斗力。
        文化：艾兰德尔的文化深受骑士精神影响，骑士不仅是战士，更是国度的象征。他们守护国土、保护人民，并承担着防御帝国安全的责任。忠诚、荣誉、勇气是骑士最核心的美德。
        无论是贵族还是平民，所有人都会崇敬骑士的力量与精神。
      </div>
      <div>
        赛力斯王国
        特点：一个致力于创造人造神山的国家，借助魔法与高科技融合的力量，试图弥补自然界的缺陷。与魔界同时在地面与海上交界。
        文化与特色：赛力斯王国的核心信念是“人类自强”——他们认为，既然自然界已经不再提供足够的庇护，那么人类就应该借助自己的力量创造出能够抵抗外界污染、保护人民的庇护。
        为此，王国的科学家和巫师们联手，正在研究一种叫做“神山造物计划”的宏大项目，试图通过科技和古老魔法的结合，制造出一个类似于神山的巨大设施，能够为王国提供保护，
        像天幕一样抵挡外界的污染与断界。科技与魔法的结合：赛力斯的技术非常先进，尤其在能量转换和结构建造上有独特的突破。
        同时，王国中的巫师团体对古代魔法有着深入研究，他们试图将这些古老的力量与现代科技结合，制造出强大而稳定的庇护结构。
        通过这项技术，赛力斯试图让自己摆脱“天幕遗孤”的身份，拥有自主的保护力。军队：赛力斯的军队大多数是高科技战士，配备能量护甲和力场武器，
        而且军队内有不少成员是曾经参与神山造物计划的魔法师或科学家。除了常规的步兵和骑士，赛力斯的军队还拥有独特的“天柱守卫”，
        这些守卫是基于人工天柱的技术所改良出的特殊部队，具有强大的防御和恢复能力。王室与统治者：赛力斯的国王是这项伟大计划的首席科学家和魔法大师，
        他的决策不仅仅依据政治需要，也要考虑科学实验的结果与魔法力量的反馈。王国的王室有时像一个研究委员会，成员们都是学者和技术专家，
        他们常常举行“议会实验”，共同探讨如何加速神山替代品的构建。特殊设施：赛力斯王国有一座巨大的实验塔，这个塔不仅是王国的象征，
        也是神山造物计划的指挥中心。塔内布满了魔法阵和科技设备，是一个神秘且危险的地方。除此之外，王国还建设了大量的能量收集装置，
        用于为人造神山提供必要的动力支持。人民生活：虽然王国在追求科技与魔法融合的道路上投入大量资源，但普通民众的生活并不轻松。
        大部分人类居住在靠近研究设施的城市，而其他地方则是大规模的工程建设区，工人们的生活条件较为艰苦。为了保持秩序和稳定，王国制定了严格的社会分层制度，
        高层学者和官员居住在王国的中心，而普通民众则在外围的建筑群和工厂中劳作。
      </div>
      <div>
        萨伊达王国 - 烈焰与黄金之国 风格关键词：
        沙漠、流沙神殿、炼金术、火焰信仰、星辰占卜简介：位于沙海之中，萨伊达王国建立在古代炼金术与星辰知识的遗迹之上。他们信仰“烈焰神祇”，
        认为金属与生命都由烈火锤炼。王室是“天命恒星”的后裔，能通过星象解析断界活动。地底隐藏着庞大的熔金机械与神庙网络。
        在沙漠上与魔界交界。特色力量： 星图炼金、沙尘召唤、火焰魔神、断界燃金炉
      </div>
      <div>
        羽川幕府 - 雾隐之国风格关键词：
        幕府体制、阴阳术、妖魔封印、镜之结界、雾中城简介：山海之间的神秘幕府国家，以“封印术”起家，世代负责阻止断界裂隙在远东地区蔓延。
        他们擅长镜中世界与幻术迷阵，王族信奉“镜神”，有极强的灵视与预兆能力。妖怪、幽魂、镜兽等被当作研究与驯化对象。
        整个岛链的一部分在魔界内，另外在海上与魔界交界。特色力量：
        镜面结界、封印符术、灵狐契约、梦境穿行
      </div>
      <div>
        炎国Yan Empire 十三王国中版图最大、人口最多、历史最悠久的国家
        政体：君主立宪制的变种 —— 拥有强势的“帝室”与掌握实权的“内阁六部”
        地理结构： 中央皇都与九重朝城 内陆山川湖泊环绕的乡野之地
        南方仙山与道林、北方妖谷与古泽 东南沿海为“新式工港区”，机械蒸汽高度发展
        中央权谋（帝都·焰京） 特色： 皇宫“天焰宫”高悬浮空，由四大天柱浮石托举
        九重朝城层层设防，等级制度森严
        六部制度（吏、户、礼、兵、工、言）彼此倾轧 常见势力：
        太后、太子、内务府、监察院、长生宫（帝室秘密机关）
        地理分布：炎国西南方向的“玄虚山系”、“望霞云岭” 特色宗派：
        天一门：修炼“灵炁”操控天气 赤云观：研究星辰天象，修“梦中行道”
        清镜斋：注重内修灵魂，亦与断界微弱共鸣
        身份地位：受朝廷礼部册封为“山灵七道”，但有“不得干政”之约
        分布：北境密林、内陆乡野
        背景：古时“妖神十三祠”与人族共治，后妖退入“妖界交汇地带”
        现状：妖族以“客灵”身份生活，有专属“灵籍”与“妖约法” 知名组织：
        《缥缈志录》编辑部：官方志怪调查机构
        “守山人”：负责维护人与妖之间约定的人类与妖族混血后裔
        中心港口城市：雾歧港、琅岚湾、铁燧城 科技源：
        结合西洋残存科技与东方美学的“灵蒸术” 以“符咒电路”和“天工机关”为代表
        典型势力： 燧火会（灵能工匠联盟） 铁轮机关局（武装技术管理部）
        海权商会（掌握对外贸易）
        焰军三卫：天焰卫（直属皇帝）、金焰军（御前机甲部队）、赤鳞军（南方妖族兵团）
        监察力量：由“言部”控制，拥有影子组织“静语堂” 特殊力量：
        “燃灯者”：能与神山残余联系者，负责镇守天柱断痕
        “焰骨继承人”：皇族血脉中能承载天焰意志的候选者
        神兽图腾：朱焰玄龙（吞火化土，传说为神山之首）
        礼仪制度：极为繁复，尚火、尚红、尚炉鼎之器
        神祇体系：以“焰中真理”为尊，承认仙神、妖灵与古祀共
        炎国为断界“净化科技”最成熟的国家之一 拥有“焰炉净界器”能暂时稳定局部断界
        也是断界研究资料最完整之国，由“清镜斋”与“工部下属机关局”共管
      </div>
      <h1>Game Guide</h1>
      <p>Compulsory Tutorial 进入游戏-菜单-强制指引-序幕-结束指引</p>
      <p>
        序幕·魔界之门:任务1【逃出生天】使用主角战斗,简单移动、普通攻击、战斗机制-士气系统与包围机制、地图与任务和设置系统页面介绍、胜利条件
      </p>
      <p>获得主角卡与角色卡介绍、属性机制介绍</p>
      <p>任务2【友军汇合】</p>
      <p>技能使用、NPC友军单位的出现与介绍、英雄单位与士兵单位的介绍</p>
      <p>
        任务3【指挥战役】（获得战役暂时士兵-仅限于该任务、阵营系统的介绍、指挥系统、战场地形机制介绍）
      </p>
      <p>
        商店介绍、资源介绍、购买技能书、主角卡获得新技能、主角卡技能升级,购买英雄,获得新角色、固定技能机制介绍、自由技能位介绍
      </p>
      <p>任务4【突围战】</p>
      <p>
        任务5【抉择】选择一个阵营的地区发展,未来很长一段时间你都会待在这里。
      </p>
      <p>建筑物单位介绍</p>
      <h3>Skill Tree</h3>
      <p>
        技能树与职业模板对应。所有的固定技能，都是自成一体的小技能组，并且出自特定职业模板的技能树。
        一般来说，一个角色是按照一个职业模板去设计的,所以一般情况,固定技能组的来源只是1个技能树。
        玩家应当优先用自由技能位完成这个技能树。
      </p>
      <p>
        同一个技能树的技能可以具有技能组共鸣-额外加成，完全学会一个技能树会有额外加成。
      </p>
      <h1>Heroes</h1>
      <h3>Protagonist Chaos Knight</h3>
      <p>
        主角混沌骑士的特点-属性超群+无固定技能+无等级上限。所有其他英雄角色的初始属性都按照职业模板，并且有一部分固定技能，和等级上限=技能位上限。
      </p>
      <p>因此主角卡可以配合任何卡阵容，取决于玩家自己。</p>
      <h3>Free To Play Heroes</h3>
      <p>黑铁:3个固定技能,等级上限=25</p>
      <p>青铜:4个固定技能,等级上限=50</p>
      <p>白银:5个固定技能,等级上限=75</p>
      <p>黄金:6个固定技能,等级上限=100</p>
      <p>史诗:7个固定技能,等级上限=150</p>
      <p>传说:8-9个固定技能,等级上限=200</p>
      <h3>Paid Heroes</h3>
      <p>圣者:10个固定技能,等级上限=300</p>
      <p>神话:12个固定技能,等级上限=400</p>
      <p>
        不光是固定技能的数量不同,他们的强度,和复杂度,也是不同的。越高级的英雄,技能机制与数值越高。
      </p>
      <p>品质突破机制：部分低级卡有晋级方法。</p>
      <p>经验：主角卡与角色卡的升级。 技能点：角色技能的升级。</p>
      <h1>游戏货币</h1>
      <p>
        全能石:可以通过完成任务,和达成成就等多种途径获得,每日任务属于后期固定的farming,也可以购买。全能石用于角色购买。
      </p>
      <p>
        金币：可以通过完成任务,和达成成就等多种途径获得,每日任务属于后期固定的farming,也可以购买。金币用于装备和技能书购买。
      </p>
      <p>
        在战斗中,一个英雄最高可以有20技能位。尽管有这么多技能位。在设计上,通过下位技能与上位技能的替换关系,
        和为了操作体验的技能数量限制,将一部分生活技能转化到非战斗系统当中。
        而且技能位只能放置主动技能，被动技能不占空间，要么算作状态，要么算作属性面板。
        实际上，战斗中所占用的技能，不会占据全部技能位。
      </p>
      <p>
        许多主动技能都有对应的上位技能，从设计上是完全替代下位技能的，下位技能没有在战斗位上保留的必要，在操作上会更方便。
        许多技能是被动技能，不能放在战斗位上，学会了就会直接发挥效果-改变人物面板。
        除了抽卡之外,在剧情任务中推进主线,总共会获得剧情角色6位【1个黑铁、1个青铜、1个白银、1个黄金、1个史诗、一个传说,
        选择阵营后，会获得该阵营的传说角色，但代价是不能购买敌对阵营的角色。只有在击败敌对阵营之后，才会重新解锁购买这个阵营角色的权利。
      </p>
      <h1></h1>
      <h1>Generic Units 普通士兵 {"(Common to all factions)"}</h1>
      <h3>
        That is, their stats would be the same, and are functional equivalents,
        despite being visually different.
      </h3>
      <p>Light Infantry</p>
      <p>Heavy Infantry</p>
      <p>More to be added</p>
      <h1>Faction Elite Units 精英士兵</h1>
      <h3>
        阵营专属兵种，有不定量的固定技能组合的精锐，可升级，受益于科技。选择阵营之后才会解锁精英士兵，代价是其他阵营的精英士兵封锁，直到击败敌对阵营，才会解锁。
      </h3>
      <h1>Buildings建筑单位</h1>
      <p>
        所有阵营共同使用的一系列基础建筑单位,受益于科技,在资源点上修建。资源点包含：物资资源、人力资源、能源资源、科技点资源。
        这是比较抽象的表现形式,只是为了简单和泛用而采用的设定。
      </p>
      <p>
        奇观:阵营专属建筑,联系阵营背后的神,开启阵营专属圣者任务与神话任务,完成该任务后分别获得圣者路线-解锁200级以上,与封神路线-解锁300级以上。
        选择阵营之后才会解锁奇观,代价是其他阵营的奇观封锁,直到击败敌对阵营神灵，才会解锁。
      </p>
      <h1>野怪单位</h1>
      <p></p>
      <h1>BOSS单位</h1>
      <p></p>
      <h1>功能性NPC</h1>
      <p>科技、装备、资源点、建筑、士兵。</p>
      <h1></h1>
      <p>物资：用于科技、建筑、士兵。</p>
      <p>人力：用于科技、建筑、士兵</p>
      <p>能源：用于科技、建筑、士兵</p>
      <p>科技点：用于科技、建筑</p>
      <p>敌对阵营的npc不会为你服务,除非你征服了那个阵营。</p>
      <h1>阵营系统</h1>
      <p>每个阵营都有自己信仰的神。</p>
      <h1>任务</h1>
      <p>
        任务系统：所有的任务都在世界地图上，没有开放世界。但世界地图有很多个。
        发布任务的NPC,不同地区的支线任务。这些npc当中有些并不是严格意义上的npc,而是可以购买组团的角色。
        不过,如果阵营敌对的话,无法购买该阵营角色。
      </p>
      <h3>战争任务</h3>
      <p>
        不可推迟，一旦爆发就必须优先完成，其他任务封锁。失败则丢失领土。成功则获得领土。
        战力不足可以试图求和，这依靠全团魅力值-求和失败依然会爆发战争。战争失利会丢失领土。
        如果自身阵营战败,那么必须重来。玩家可以体验不同的阵营。
        尽管可以选择不同的阵营,但是玩家的开始都是相同的:序幕是固定的剧情。
      </p>
      <h3>每日任务</h3>
      <p>地下城迷宫探险</p>
      <p>海盗入侵</p>
      <p>深海断界</p>
      <p>边境冲突</p>
      <p>魔界入侵（天幕之外，即为魔界）</p>
      <p>天空断界</p>
      <p>深渊无限层-通过地下城666层之后,出现的无限闯关模式</p>
      <p>
        星海（充斥着堕落星神。他们的领袖是时间与空间权柄汇聚一身的堕落天空父神，
        和物质与生命权柄汇聚一身的堕落大地母神。好在这两个神陷入了疯狂的争斗，
        只是余波波及到凡人，并不在乎凡人。）
      </p>
      <p>
        神战任务:击败所属阵营的神,替代祂,真正掌控所在的阵营。然后击败天幕世界的众神。
      </p>
      <p>世界任务1:征服整个天幕世界，统一十三王国，海盗，地下城。</p>
      <p>世界任务2:征服魔界。</p>
      <p>世界任务3:征服灵界。</p>
      <p>世界任务4:征服星海，击败众多原始古神，汇聚全部权柄，成为神上神。</p>
      <p>世界任务5:迎战深渊意志-消灭深渊意志。</p>
      <p>
        特殊阵营:深渊。
        深渊：深渊是世界外侧，是创世之初构建秩序排斥出的混乱侧，里面残存了许多创世之初的遗留物，甚至是旧日纪元的遗留物，当宇宙从深邃虚空中汲取力量，也会吸引到一些世界碎片，以及其他的世界。是堕落天空父神与堕落大地母神在斗争中释放神灵本体，刺激了深渊意志的觉醒。
        仙界碎片：上个纪元的遗留物（天庭、神仙、三十六洞天、七十二福地、三千道统）。灵界的主人，疑似从上个纪元跨越过来的存在。
        两种途径。一是在任务1连续失败多次就会在深渊重生为恶魔,自动归属深渊阵营,所有其他阵营封锁-直到击败他们。
        二是闯关胜利地下城666层,可以选择成为恶魔，或者付出一定代价逃走。最终目的是让天与地重合-神话以下全部单位死亡-深渊线是直达世界任务的快车通道，但也是难度最高的路线。
        因为深渊的胜利,深渊意志前所未有的强大,作为最终boss更难对付。
      </p>
      <p>特殊阵营:星海。</p>
      <p>
        特殊阵营:灵界（七重天：灵能、梦幻、元素、天使…）-深渊的对立面。灵界之主神秘失踪,有人认为,混沌骑士就是他。
      </p>
      <p>
        DLC:世界之外的敌人
        世界任务结束后,可以选择开启二周目,重开地水火风。拥有的英雄、神器,全部转化为全能石。全能石保留,在二周目及以后继续使用。
        圣者、神话花钱购买的自然继续拥有,但是等级清零,区别是这一次关系固定100%，不受阵营敌对的影响。
        开启二周目之后，新增【深邃虚空】，迎战世界之外的敌人。迎战世界之外的敌人的时候，等级自动满级，技能自定义+满级，所有英雄可以使用，所有神器可以使用。
        深邃虚空考验的更是对游戏的理解和操作。如果失败的话,混沌骑士在战败的时候会引爆整个世界同归于尽。新世界重新孕育,开启新周目,游戏进程重来一遍。
      </p>
    </div>
  );
};

export default CHAOSWIKI;
